app/controllers/shares_controller.rb

SELECT "shares".* FROM "shares"
---
  def index
    @shares = Share.all