app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password", "created_at", "updated_at", "confirm_token") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save